load-test-results-20251120-164401/API_Gateway_Authenticated.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api-gateway-3daykcsw5a-ew.a.run.app (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        Google
Server Hostname:        api-gateway-3daykcsw5a-ew.a.run.app
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api-gateway-3daykcsw5a-ew.a.run.app

Document Path:          /api/v1/users/profile
Document Length:        540 bytes

Concurrency Level:      20
Time taken for tests:   38.528 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      1042000 bytes
HTML transferred:       540000 bytes
Requests per second:    25.96 [#/sec] (mean)
Time per request:       770.562 [ms] (mean)
Time per request:       38.528 [ms] (mean, across all concurrent requests)
Transfer rate:          26.41 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      211  522 259.1    484    7382
Processing:   154  226  76.6    204     682
Waiting:      154  219  63.1    202     676
Total:        393  748 274.4    709    7694

Percentage of the requests served within a certain time (ms)
  50%    709
  66%    745
  75%    787
  80%    819
  90%    946
  95%   1039
  98%   1176
  99%   1547
 100%   7694 (longest request)