load-test-results-20251120-164401/API_Gateway_Public.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api-gateway-3daykcsw5a-ew.a.run.app (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        Google
Server Hostname:        api-gateway-3daykcsw5a-ew.a.run.app
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api-gateway-3daykcsw5a-ew.a.run.app

Document Path:          /actuator/info
Document Length:        130 bytes

Concurrency Level:      20
Time taken for tests:   36.274 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      585016 bytes
HTML transferred:       130000 bytes
Requests per second:    27.57 [#/sec] (mean)
Time per request:       725.472 [ms] (mean)
Time per request:       36.274 [ms] (mean, across all concurrent requests)
Transfer rate:          15.75 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      215  501 135.5    470    1577
Processing:   130  192  85.6    173    1199
Waiting:      130  185  71.1    171    1199
Total:        364  692 163.1    652    1758

Percentage of the requests served within a certain time (ms)
  50%    652
  66%    689
  75%    727
  80%    747
  90%    847
  95%    986
  98%   1187
  99%   1595
 100%   1758 (longest request)