load-test-results-20251120-164401/User_Service_Direct.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking user-service-3daykcsw5a-ew.a.run.app (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        Google
Server Hostname:        user-service-3daykcsw5a-ew.a.run.app
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        user-service-3daykcsw5a-ew.a.run.app

Document Path:          /actuator/health
Document Length:        429 bytes

Concurrency Level:      20
Time taken for tests:   35.764 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      872000 bytes
HTML transferred:       429000 bytes
Requests per second:    27.96 [#/sec] (mean)
Time per request:       715.274 [ms] (mean)
Time per request:       35.764 [ms] (mean, across all concurrent requests)
Transfer rate:          23.81 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      200  502 136.9    475    1856
Processing:   133  195  73.5    175     680
Waiting:      132  188  59.2    174     593
Total:        361  697 158.5    660    2026

Percentage of the requests served within a certain time (ms)
  50%    660
  66%    701
  75%    742
  80%    768
  90%    853
  95%    984
  98%   1189
  99%   1271
 100%   2026 (longest request)