load-test-results-20251120-164401/User_Service_Health.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking user-service-3daykcsw5a-ew.a.run.app (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        Google
Server Hostname:        user-service-3daykcsw5a-ew.a.run.app
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        user-service-3daykcsw5a-ew.a.run.app

Document Path:          /actuator/health
Document Length:        429 bytes

Concurrency Level:      20
Time taken for tests:   35.819 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      872000 bytes
HTML transferred:       429000 bytes
Requests per second:    27.92 [#/sec] (mean)
Time per request:       716.380 [ms] (mean)
Time per request:       35.819 [ms] (mean, across all concurrent requests)
Transfer rate:          23.77 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      210  504 109.4    481    1621
Processing:   136  194  75.2    177    1536
Waiting:      130  190  70.4    176    1536
Total:        385  698 137.7    675    2068

Percentage of the requests served within a certain time (ms)
  50%    675
  66%    713
  75%    750
  80%    770
  90%    841
  95%    905
  98%    984
  99%   1216
 100%   2068 (longest request)